from .first_era_watat_strategy import FirstEraWatatStrategy

# ပထမခေတ်က ရတနာပူရ အင်းဝခေတ် လထပ် စည်းကမ်းကို သုံးခဲ့တဲ့ ခေတ်ဖြစ်ပြီး 
# ၁၉ နှစ် လစက်ဝန်း (Metonic cycle) ကို အခြေခံပါတယ်။ 
# မြန်မာ သက္ကရာဇ်ကို ၁၉ နဲ့စားပြီး အကြွင်း ၂၊ ၅၊ ၇၊ ၁၀၊ ၁၃၊ ၁၅၊ ၁၈ ရတဲ့နှစ်တွေမှာ လထပ်ပါတယ်။ 
# ခြွင်းချက်အနေနဲ့ သက္ကရာဇ် ၁၂၀၂ မှ လထပ်ရမယ့် အစား ၁၂၀၁ မှာလထပ်ထားတာ တွေ့ရပါတယ်။ 
# ဦးအုန်းကြိုင်က "၁၉ ခုဝါဒ လထပ်ကိန်း မူသေကိန်းဖြင့် သက္ကရာဇ် ၁၂၀၁ ၌လထပ်မပြုဘဲလျက် အမ္မာဝါသီ နှစ်ထပ်မြင်ခြင်းကို ရှု၍ လထပ်သောကြောင့် မူသေလထပ်နည်း တကြိမ် ပြောင်းခဲ့၏။" လို့ဆိုပါတယ်
# မြန်မာ သက္ကရာဇ် ၁၂၁၇ (1855 CE) ကစပြီး ၁၉ နှစ်နည်းကို မသုံးတော့ပေမယ့် စာတမ်းတချို့ နဲ့ တချို့အင်တာနက်စာမျက်နှာတွေမှာ 
# မြန်မာ ပြက္ကဒိန်က အခုထက်ထိ ၁၉ နှစ် Metonic cycle ကို သုံးတယ်လို့ မှားယွင်းဖော်ပြထားတာကို တွေ့ရပါတယ်။
# မြန်မာ ပြက္ခဒိန် ပထမခေတ်မှာ တွက်နည်း သုံးမျိုးရှိခဲ့ပါတယ်။
# မြန်မာနှစ် ၀ ခုနှစ်မှ ၇၉၇ ခုနှစ်ထိ (ပုပ္ပားစောရဟန်း သက္ကရာဇ် ဖြိုကြွင်းမှ စသည်။) မကာရန္တကျမ်း တွက်နည်းကိုသုံးသည်။
class FirstEraMakranata1WatatStrategy(FirstEraWatatStrategy):
    def __init__(self, year) -> None:
        super().__init__(year)
        self.to_check_months = -1
        self.watat_offset = -1.1
        self.watat_exceptions = {}
        self.offset_exceptions = {205: -0.1, 246: -0.1, 471: -0.1, 572: -2.1, 651: -0.1, 653: 0.9, 656: -0.1, 672: -0.1, 729: -0.1, 767: -2.1}