from .third_era_watat_strategy import ThirdEraWatatStrategy

# သူရိယသိဒ္ဓန္တကျမ်းကို မြန်မာဘာသာ ပြန်ဆိုခဲ့တဲ့ ညောင်ကန်ဆရာတော်ရဲ့ နည်းကိုသုံးတဲ့ နှစ်ပေါင်းတစ်ရာ ကြာတဲ့ခေတ်ဖြစ်ပါတယ်။ 
# သူရိယသိဒ္ဓန္တကျမ်းက မြန်မာပြည်ကို သက္ကရာဇ် ၁၂၀၃ ကရောက်ပေမယ့် 
# ၁၉ နှစ်နဲ့ စားပြီး မူသေအကြွင်း ဂဏန်း နဲ့ လထပ်ရမယ် ဆိုတဲ့ မူဝါဒ လွမ်းမိုးမှု ကို ပြောင်းလဲဖို့ အချိန်ယူရတာကြောင့် 
# သက္ကရာဇ် ၁၂၁၇ ရောက်မှ ညောင်ကန်ဆရာတော်ရဲ့ လထပ်စည်းကမ်း ကို စသုံးခဲ့ပါတယ် 
# ပထမလေးလထဲမှာ ရက်ပို တစ်လစာ ပြည့်ရင် အဲဒီနှစ်မှာပဲ ဝါထပ်ဖို့ဖြစ်ပြီး
# နောက်ဆုံးရှစ်လထဲရောက်မှ ရက်ပြည့်ပါက နောက်နှစ်မှဝါထပ်ရန်ဖြစ်ပါတယ်။ 
# ရက်ပို မပို ဆုံးဖြတ်မယ့်အချိန်ကို သတ်မှတ်ထားတဲ့ လအရေအတွက်က ရှစ်လအစား လေးလဖြစ်ပြီး 
# ကျန်တာက တတိယခေတ်နဲ့ အတူတူပဲ ဖြစ်ပါတယ်။
class SecondEraWatatStrategy(ThirdEraWatatStrategy):
    def __init__(self, year) -> None:
        super().__init__(year)
        self.to_check_months = 4
        self.watat_offset = -1
        self.watat_exceptions = {1264: False, 1263: True} # key is year and value is whether watat or not
        self.offset_exceptions = {1234: 0, 1261: -2} # key is year and value is offset